Arc provides several syntax innovations beyond Scheme.
<h2>Square-bracket anonymous functions</h2>
Anonymous functions on one variable can be created with square brackets; the underscore <code>_</code> is the variable.  For example, <code>[+ 1 _]</code> is equivalent to <code>(fn (_) (+ 1 _))</code>:
<pre class="repl">
arc> (map [+ 1 _] '(10 20 30))
(11 21 31)
</pre>
<h2>Special syntax</h2>
The "special syntax" characters are <code>:</code>, <code>~</code>, <code>.</code>, and <code>!</code>.  The <code>~</code> character provides Boolean complement of a procedure; <code>~a</code> is equivalent to <code>(complement a)</code>
<pre class="repl">
arc> (~odd 3)
nil
arc> (~even 3)
t
</pre>
The <code>:</code> character implements function composition; <code>a:b</code> is equivalent to <code>(compose a b)</code> and applies <code>a</code> to the result of applying <code>b</code>:
<pre class="repl">
arc> (odd:sqrt 4)
nil
arc> (odd:sqrt 9)
t
</pre>
The syntax <code>a.b</code> is equivalent to <code>(a b)</code>.  It is intended for structure access:
<pre class="repl">
arc> (= x '(a b c d))
(a b c d)
arc> x.2
c
</pre>
The syntax <code>a!b</code> is equivalent to <code>(a 'b)</code>.  It is intended for structure access where quoting is needed:
<pre class="repl">
arc> (= tb (obj a 10 b 20 c 30))
#hash((c . 30) (a . 10) (b . 20))
arc> tb!a
10
</pre>
